jclab-joseph/mimxrt-usb-sd-msd/source/disk.c
/* USB device class configuration information */
usb_device_class_config_list_struct_t msc_config_list = {
    msc_config,
    USB_DeviceCallback,
    1,
};

void USB_DeviceMscAppTask(void)
{
    if (g_msc.read_write_error)
    {
        return;
    }
    USB_DeviceMscApp();
}
/*!
 * @brief device application init function.
 *
 * This function init the usb stack and sdhc driver.
 *
 * @return None.
 */
void USB_DeviceApplicationInit(void)
{
    USB_DeviceClockInit();
#if (defined(FSL_FEATURE_SOC_SYSMPU_COUNT) && (FSL_FEATURE_SOC_SYSMPU_COUNT > 0U))
    SYSMPU_Enable(SYSMPU, 0);
#endif /* FSL_FEATURE_SOC_SYSMPU_COUNT */

    usb_echo("Please insert disk \r\n");

    if (kStatus_USB_Success != USB_DeviceMscDiskStorageInit())
    {
        usb_echo("Disk init failed\r\n");
        return;
    }

    // SDCardTest();

    g_xMutex            = xSemaphoreCreateMutex();

    g_sdReadRequestHandle = xQueueCreate(1, sizeof(uint32_t) * 2);
    g_sdReadResponseHandle = xQueueCreate(1, sizeof(uint32_t) * 2);

#if (defined(USB_DEVICE_MSC_USE_WRITE_TASK) && (USB_DEVICE_MSC_USE_WRITE_TASK > 0))

    // g_xMutex            = xSemaphoreCreateMutex();
    g_writeBufferHandle = xQueueCreate(USB_DEVICE_MSC_WRITE_BUFF_NUM, sizeof(uint32_t *));
    for (int i = 0; i < USB_DEVICE_MSC_WRITE_BUFF_NUM; i++)
    {
        uint8_t *bufferAddress = (uint8_t *)&g_mscWriteRequestBuffer[i][0];
        xQueueSend(g_writeBufferHandle, &bufferAddress, 0);
    }
    g_writeTaskHandle = xQueueCreate(USB_DEVICE_MSC_WRITE_BUFF_NUM, sizeof(usb_device_lba_app_struct_t));
#endif

    g_msc.speed        = USB_SPEED_FULL;
    g_msc.attach       = 0;
    g_msc.mscHandle    = (class_handle_t)NULL;
    g_msc.deviceHandle = NULL;
    if (kStatus_USB_Success != USB_DeviceClassInit(CONTROLLER_ID, &msc_config_list, &g_msc.deviceHandle))
    {
        usb_echo("USB device init failed\r\n");
    }
    else
    {
        usb_echo("USB device mass storage demo\r\n");
        g_msc.mscHandle = msc_config_list.config->classHandle;
    }

    USB_DeviceIsrEnable();

    /*Add one delay here to make the DP pull down long enough to allow host to detect the previous disconnection.*/
    SDK_DelayAtLeastUs(5000, SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY);
    USB_DeviceRun(g_msc.deviceHandle);
}
#if USB_DEVICE_CONFIG_USE_TASK
void USB_DeviceTask(void *handle)
{
    while (1U)
    {
        USB_DeviceTaskFn(handle);
    }
}
#endif

void USB_MscDeviceSDReadTask(void* handle)
{
    uint32_t readRequest[2];
    uint32_t readResponse[2];
    status_t errorCode;
    int cacheIndex = 0;
    int32_t cachedOffset = -1;

    while (1)
    {
        xQueueReceive(g_sdReadRequestHandle, &readRequest, portMAX_DELAY);
        xSemaphoreTake(g_xMutex, portMAX_DELAY);
    	readResponse[1] = (uint32_t) g_mscReadRequestBuffer[cacheIndex];
        if (cachedOffset == readRequest[0])
        {
        	readResponse[0] = kStatus_Success;
        } else {
        	errorCode = USB_Disk_ReadBlocks(
        			(uint8_t*) readResponse[1],
					readRequest[0],
					readRequest[1]
			);
        	readResponse[0] = errorCode;
        }
        cachedOffset = readRequest[0] + readRequest[1];
        xQueueSend(g_sdReadResponseHandle, &readResponse[0], 0U);
        cacheIndex ^= 0x01;
        errorCode = USB_Disk_ReadBlocks(
        		(uint8_t*) g_mscReadRequestBuffer[cacheIndex],
				cachedOffset,
				USB_DEVICE_MSC_READ_BUFF_SIZE >> USB_DEVICE_DISK_BLOCK_SIZE_POWER
		);
        xSemaphoreGive(g_xMutex);
    }
}

#define TEST_BLOCK_COUNT 8
uint8_t buffer[512 * TEST_BLOCK_COUNT];
extern sd_card_t *usbDeviceMscSdcard;
void SDCardTest() {
	int st = xTaskGetTickCount();
	int dt;

	vTaskDelay(1000 / portTICK_PERIOD_MS);

	for (int i=0; i<32768; i+=TEST_BLOCK_COUNT) {
	    status_t s = SD_ReadBlocks(usbDeviceMscSdcard, buffer, i, TEST_BLOCK_COUNT);
	    if (s) {
	    	PRINTF("ERR %d\n", s);
	    }
	}
	dt = xTaskGetTickCount() - st;
	PRINTF("TIME = %d ms\n", dt);
}

void APP_task(void *handle)
{
    USB_DeviceApplicationInit();

#if USB_DEVICE_CONFIG_USE_TASK
    if (g_msc.deviceHandle)
    {
        if (xTaskCreate(USB_DeviceTask,                  /* pointer to the task */
                        (char const *)"usb device task", /* task name for kernel awareness debugging */
                        5000L / sizeof(portSTACK_TYPE),  /* task stack size */
                        g_msc.deviceHandle,              /* optional task startup argument */
                        5,                               /* initial priority */
                        &g_msc.device_task_handle        /* optional task handle to create */
                        ) != pdPASS)
        {
            usb_echo("usb device task create failed!\r\n");
            return;
        }
    }
#endif
#if (defined(USB_DEVICE_MSC_USE_WRITE_TASK) && (USB_DEVICE_MSC_USE_WRITE_TASK > 0))
    if (xTaskCreate(USB_DeviceMscWriteTask,         /* pointer to the task */
                    (char const *)"write task",     /* task name for kernel awareness debugging */
                    2000L / sizeof(portSTACK_TYPE), /* task stack size */
                    NULL,                           /* optional task startup argument */
                    4,                              /* initial priority */
                    &g_usbWriteTaskHandle           /* optional task handle to create */
                    ) != pdPASS)
    {
        usb_echo("write task create failed!\r\n");
        return;
    }
#endif

    if (xTaskCreate(USB_MscDeviceSDReadTask,         /* pointer to the task */
                        (char const *)"sd read cache task",     /* task name for kernel awareness debugging */
                        512L / sizeof(portSTACK_TYPE), /* task stack size */
                        NULL,                           /* optional task startup argument */
                        4,                              /* initial priority */
                        &g_sdReadTaskHandle           /* optional task handle to create */
                        ) != pdPASS)
        {
            usb_echo("read task create failed!\r\n");
            return;
        }

    while (1)
    {
    }
}

#if defined(__CC_ARM) || (defined(__ARMCC_VERSION)) || defined(__GNUC__)
int main(void)
#else
void main(void)
#endif
{
    /* Init board hardware. */
    BOARD_ConfigMPU();
    BOARD_InitBootPins();
    BOARD_InitBootClocks();
    BOARD_InitBootPeripherals();
#ifndef BOARD_INIT_DEBUG_CONSOLE_PERIPHERAL
    /* Init FSL debug console. */
    BOARD_InitDebugConsole();
#endif
    BOARD_USB_Disk_Config(USB_DEVICE_INTERRUPT_PRIORITY);

    PRINTF("BOARD START\n");

    if (xTaskCreate(APP_task,                       /* pointer to the task */
                    (char const *)"app task",       /* task name for kernel awareness debugging */
                    1000L / sizeof(portSTACK_TYPE), /* task stack size */
                    &g_msc,                         /* optional task startup argument */
                    3,                              /* initial priority */
                    &g_msc.application_task_handle  /* optional task handle to create */
                    ) != pdPASS)
    {
        usb_echo("app task create failed!\r\n");
#if (defined(__CC_ARM) || (defined(__ARMCC_VERSION)) || defined(__GNUC__))
        return 1;
#else
        return;
#endif
    }
    vTaskStartScheduler();

#if (defined(__CC_ARM) || (defined(__ARMCC_VERSION)) || defined(__GNUC__))
    return 1;
#endif
}
